#Напишіть цикл, який буде вимагати від користувача ввести слово,
#в якому є літера "h" (враховуються як великі так і маленькі).
#Цикл не повинен завершитися, якщо користувач ввів слово без букви "h".



while True:
    word = input("Введіть слово, де є буква 'h' або 'H': ")

    # Перевіряємо наявність маленької або великої букви 'h'
    if 'h' in word or 'H' in word:
        print("Слово містить букву 'h' або 'H'. Цикл завершено.")
        break  # вихід з циклу
    else:
        print("Слова без букви 'h'. Спробуйте ще раз.")
